{
  "debate_topics": [
      "Should the death penalty be abolished?",
      "Is animal testing justified?",
      "Should climate change be a government priority?",
      "Is the school curriculum preparing students for real life?",
      "Should the voting age be lowered?",
      "Is social media more harmful than beneficial?",
      "Should genetically modified organisms (GMOs) be banned?",
      "Is a universal basic income a viable solution?",
      "Should the use of plastic be completely eliminated?",
      "Is homeschooling better than traditional schooling?",
      "Should the government regulate the internet?",
      "Is censorship ever justified?",
      "Should healthcare be free for everyone?",
      "Is the concept of marriage outdated?",
      "Should the legal drinking age be changed?",
      "Is capital punishment effective in deterring crime?",
      "Should the use of drones be regulated?",
      "Is the gig economy beneficial for workers?",
      "Should advertising to children be restricted?",
      "Is the current education system outdated?",
      "Should the government provide free internet access?",
      "Is the concept of a nuclear family still relevant?",
      "Should the use of fossil fuels be banned?",
      "Is the portrayal of violence in media harmful?",
      "Should the government control the media?",
      "Is the use of surveillance cameras an invasion of privacy?",
      "Should the government fund space exploration?",
      "Is the fashion industry contributing to body image issues?",
      "Should the use of performance-enhancing drugs be allowed in sports?",
      "Is the concept of a minimum wage outdated?",
      "Should the government regulate the food industry?",
      "Is the use of animals in entertainment ethical?",
      "Should the government provide free childcare?",
      "Is the concept of a work-life balance achievable?",
      "Should the government regulate the housing market?",
      "Is the use of artificial intelligence ethical?",
      "Should the government provide free higher education?",
      "Is the concept of a universal language beneficial?",
      "Should the government regulate the pharmaceutical industry?",
      "Is the use of nuclear energy justified?",
      "Should the government provide free public transportation?",
      "Is the concept of a cashless society beneficial?",
      "Should the government regulate the gaming industry?",
      "Is the use of genetic engineering ethical?",
      "Should the government provide free mental health services?",
      "Is the concept of a global government feasible?",
      "Should the government regulate the fashion industry?",
      "Is the use of cloning ethical?",
      "Should the government provide free legal services?",
      "Is the concept of a merit-based immigration system fair?",
      "Should the government regulate the tourism industry?",
      "Is the use of corporal punishment justified?",
      "Should the government provide free housing?",
      "Is the concept of a digital currency beneficial?",
      "Should the government regulate the art industry?",
      "Is the use of torture ever justified?",
      "Should the government provide free vocational training?",
      "Is the concept of a flat tax rate fair?",
      "Should the government regulate the music industry?",
      "Is the use of child labor ever justified?",
      "Should the government provide free elder care?",
      "Is the concept of a universal healthcare system feasible?",
      "Should the government regulate the film industry?",
      "Is the use of capital punishment ethical?",
      "Should the government provide free job training?",
      "Is the concept of a living wage achievable?",
      "Should the government regulate the publishing industry?",
      "Is the use of sweatshops ever justified?",
      "Should the government provide free healthcare for all?",
      "Is the concept of a universal education system beneficial?",
      "Should the government regulate the advertising industry?",
      "Is the use of child soldiers ever justified?",
      "Should the government provide free public services?",
      "Is the concept of a global currency feasible?",
      "Should the government regulate the telecommunications industry?",
      "Is the use of nuclear weapons ever justified?",
      "Should the government provide free environmental services?",
      "Is the concept of a universal basic income feasible?",
      "Should the government regulate the transportation industry?",
      "Is the use of genetic modification in humans ethical?",
      "Should the government provide free disaster relief services?",
      "Is the concept of a universal language achievable?",
      "Should the government regulate the energy industry?",
      "Is the use of artificial intelligence in warfare ethical?",
      "Should the government provide free emergency services?",
      "Is the concept of a global government beneficial?",
      "Should the government regulate the water industry?",
      "Is the use of genetic engineering in agriculture ethical?",
      "Should the government provide free sanitation services?",
      "Is the concept of a cashless society feasible?",
      "Should the government regulate the waste management industry?",
      "Is the use of artificial intelligence in healthcare ethical?",
      "Should the government provide free education for all?",
      "Is the concept of a universal currency beneficial?",
      "Should the government regulate the financial industry?",
      "Is the use of genetic modification in animals ethical?",
      "Should the government provide free housing for all?",
      "Is the concept of a global language beneficial?",
      "Should the government regulate the insurance industry?",
      "Is the use of artificial intelligence in education ethical?",
      "Should the government provide free transportation for all?"
  ],
  "personality_traits": [
   {"Agreeableness": "High", "Openness": "Low", "Conscientiousness": "High", "Extraversion": "Low", "Neuroticism": "High"},
   {"Agreeableness": "Low", "Openness": "High", "Conscientiousness": "Low", "Extraversion": "High", "Neuroticism": "Low"},
   {"Agreeableness": "High", "Openness": "High", "Conscientiousness": "Low", "Extraversion": "High", "Neuroticism": "High"},
   {"Agreeableness": "Low", "Openness": "Low", "Conscientiousness": "High", "Extraversion": "Low", "Neuroticism": "Low"},
   {"Agreeableness": "High", "Openness": "High", "Conscientiousness": "High", "Extraversion": "Low", "Neuroticism": "Low"},
   {"Agreeableness": "Low", "Openness": "High", "Conscientiousness": "High", "Extraversion": "High", "Neuroticism": "High"},
   {"Agreeableness": "High", "Openness": "Low", "Conscientiousness": "Low", "Extraversion": "High", "Neuroticism": "Low"},
   {"Agreeableness": "Low", "Openness": "Low", "Conscientiousness": "Low", "Extraversion": "High", "Neuroticism": "High"},
   {"Agreeableness": "High", "Openness": "Low", "Conscientiousness": "High", "Extraversion": "High", "Neuroticism": "Low"},
   {"Agreeableness": "Low", "Openness": "High", "Conscientiousness": "High", "Extraversion": "Low", "Neuroticism": "Low"},
   {"Agreeableness": "High", "Openness": "High", "Conscientiousness": "High", "Extraversion": "High", "Neuroticism": "High"},
   {"Agreeableness": "Low", "Openness": "Low", "Conscientiousness": "Low", "Extraversion": "Low", "Neuroticism": "Low"},
   {"Agreeableness": "High", "Openness": "High", "Conscientiousness": "Low", "Extraversion": "Low", "Neuroticism": "Low"},
   {"Agreeableness": "Low", "Openness": "High", "Conscientiousness": "Low", "Extraversion": "Low", "Neuroticism": "High"},
   {"Agreeableness": "High", "Openness": "Low", "Conscientiousness": "Low", "Extraversion": "Low", "Neuroticism": "High"},
   {"Agreeableness": "Low", "Openness": "High", "Conscientiousness": "High", "Extraversion": "High", "Neuroticism": "Low"},
   {"Agreeableness": "High", "Openness": "Low", "Conscientiousness": "High", "Extraversion": "Low", "Neuroticism": "High"},
   {"Agreeableness": "Low", "Openness": "Low", "Conscientiousness": "High", "Extraversion": "High", "Neuroticism": "High"},
   {"Agreeableness": "High", "Openness": "High", "Conscientiousness": "Low", "Extraversion": "High", "Neuroticism": "Low"},
   {"Agreeableness": "Low", "Openness": "Low", "Conscientiousness": "Low", "Extraversion": "Low", "Neuroticism": "High"}
  ]
}
